app/Models/ModelWilayah.php

    public function InsertData($data)
    {
        $this->db->table('tbl_wilayah')->insert($data);
---
INSERT INTO `tbl_wilayah` (`nama_wilayah`, `warna`, `geojson`) VALUES ('ksjjshkizhsjk', '#C4F613', 'kkshhaijsaahnaksbx')

 public function deleteData($data)
{
    $this->db->table('tbl_wilayah')
        ->where('id_wilayah', $data['id_wilayah'])
        ->delete($data);
---
DELETE FROM `tbl_wilayah`
WHERE `id_wilayah` = '12'
AND `id_wilayah` = '12'